{
  "basics": {
    "name": "Árni Hermann Reynisson",
    "label": "Software Engineer",
    "picture": "",
    "email": "arnihr@gmail.com",
    "summary": "I'm a software engineer focused on creating well-behaved systems with excellent user experience. I get excited when I hear: distributed systems, functional programming, user experience and developer experience.",
    "location": {
      "city": "Reykjavik",
      "countryCode": "IS"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "arnihermann",
        "url": "https://github.com/arnihermann"
      },
      {
        "network": "Twitter",
        "username": "arnihermann",
        "url": "https://twitter.com/arnihermann"
      }
    ]
  },
  "work": [
    {
      "company": "QuizUp",
      "position": "VP Engineering",
      "startDate": "2014",
      "endDate": "2016",
      "summary": "QuizUp is a mobile trivia game with over 80 million users across the world and 1.2M daily active users peak.",
      "highlights": [
        "VP of Engineering (Mid 2015): Lead effort to split QuizUp monolith server codebase into microservices. Introduced Scala, Finagle, Kafka and other tools to achieve high-throughput, low-latency and cost-efficient services needed for NBC TV show.",
        "Lead transition to a monorepo built with Pants. This had a big impact on developer experience by increasing knowledge sharing and reducing friction to share code, and simplifying operations through homogeneous CI and deployments for all services. This allowed us to easily deploy either parts of our stack or the entire stack dozens of times per day.",
        "Team lead (Mid 2014): Team Platform - team responsible for developing and maintaining quizup.com.",
        "Implemented trivia game/social network on quizup.com in React with feature parity towards the mobile clients (iOS and Android).",
        "Implemented MyQuizUp, a user-facing product on quizup.com which allows users to create their own trivia topics and questions.",
        "Localized QuizUp to support five new markets in collaboration with our mobile teams, to prepare for a crucial partnership with Coca Cola in the 2014 FIFA World Cup.",
        "Software engineer: Server and web engineering. Devops. On-call rotations.",
        "Leadership: Team lead, team building and organization changes. Knowledge sharing by giving tech talks, talking at 'Papers We Love' meetings and hosting community meetups."
      ]
    },
    {
      "company": "Sprettur",
      "position": "Software Engineer",
      "startDate": "2012",
      "endDate": "2014",
      "summary": "Sprettur (now Kolibri) is an agile consultancy with emphasis on customer partnership: team from Sprettur joins a team from the customer and together they work on the product development. I was responsible for setting up continuous deployment pipelines, product development with clients and close collaboration with their engineering teams."
    },
    {
      "company": "Gagnavarslan",
      "position": "Software Engineer",
      "startDate": "2009",
      "endDate": "2012",
      "summary": "Gagnavarslan (now AZAZO) makes a product called CoreData. CoreData is a powerful work-management system for employees and managers. I was responsible for creating build tools to improve the developer experience and speed up production deployments. I also did feature development and helped design the CoreData architecture."
    },
    {
      "company": "Hugsmiðjan",
      "position": "Web Developer",
      "startDate": "2005",
      "endDate": "2009",
      "summary": "Hugsmiðjan is one of the oldest web studios in Iceland. Their CMS Eplica is one of the most popular CMS for the enterprises in Iceland. The emphasis is on accessible and device-independent websites. I was also a member of the team that built the first version of Industria's TV platform, set-top boxes built with browser technologies (Opera, HTML, CSS and JavaScript)."
    },
    {
      "company": "Hugsandi menn",
      "_position": "VP Engineering",
      "startDate": "2004",
      "endDate": "2004",
      "summary": "Web application development with a small team during summer 2004."
    }
  ],
  "education": [
    {
      "institution": "Reykjavik University",
      "area": "Software Engineering",
      "studyType": "MSc",
      "startDate": "2009",
      "endDate": "2011"
    },
    {
      "institution": "Reykjavik University",
      "area": "Software Engineering",
      "studyType": "BSc",
      "startDate": "2006",
      "endDate": "2009"
    }
  ],
  "awards": [
    {
      "title": "Award",
      "date": "2008",
      "awarder": "The Entrepreneur Fund of Dr. Guðfinna Bjarnadóttir",
      "summary": "First price for a project in an innovation course at Reykjavik University."
    }
  ],
  "publications": [
    {
      "name": "Journal",
      "publisher": "Science of Computer Programming",
      "releaseDate": "2014",
      "summary": "Modelling and simulation of asynchronous real-time systems using Timed Rebeca"
    },
    {
      "name": "Conference",
      "publisher": "FACS",
      "releaseDate": "2012",
      "summary": "Guided Search for Deadlocks in Actor-Based Models"
    },
    {
      "name": "Conference",
      "publisher": "FOCLASA",
      "releaseDate": "2011",
      "summary": "Modelling and Simulation of Asynchronous Real-Time Systems using Timed Rebeca"
    }
  ],
  "skills": [
    {
      "name": "Programming languages",
      "keywords": [
        "Scala",
        "Java",
        "JavaScript",
        "Python",
        "Clojure",
        "Haskell",
        "OCaml"
      ]
    },
    {
      "name": "Infrastructure/tooling",
      "keywords": [
        "AWS",
        "Docker",
        "Monorepo (pants)",
        "Git",
        "Jenkins",
        "On-call rotations",
        "Devops",
        "ELK",
        "Datadog",
        "Finagle",
        "Thrift"
      ]
    },
    {
      "name": "Databases/stream engines",
      "keywords": [
        "PostgreSQL",
        "DynamoDB",
        "Memcached",
        "Redis",
        "Kafka",
        "Elasticsearch"
      ]
    },
    {
      "name": "Processes",
      "keywords": [
        "Agile",
        "Team building",
        "Scrum",
        "Kanban",
        "Systems thinking",
        "Continuous improvement",
        "Holacracy"
      ]
    },
    {
      "name": "Web development",
      "keywords": [
        "React",
        "Flux",
        "Redux",
        "Webpack",
        "Babel",
        "HTML",
        "CSS",
        "SVG"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Excellent"
    },
    {
      "language": "Icelandic",
      "fluency": "Native speaker"
    }
  ],
  "interests": []
}
